Revit 2026 API

# ExporterIFCAddBuildingStorey Method

---

**Note: This API is now obsolete.**

Adds building storey to the exporter's internal cache.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
public void AddBuildingStorey(
	ElementId id,
	IFCLevelInfo levelInfo
)
```
```vb
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>
Public Sub AddBuildingStorey (
	id As ElementId,
	levelInfo As IFCLevelInfo
)
```
```cpp
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
void AddBuildingStorey(
	ElementId^ id,
	IFCLevelInfo^ levelInfo
)
```
```fsharp
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>]
member AddBuildingStorey :
        id : ElementId *
        levelInfo : IFCLevelInfo -> unit
```

#### Parameters

id ElementId
     The level id.
levelInfo IFCLevelInfo
     The IFCLevelInfo object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace